sugarcrm-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/sugarcrm/getMultipleEntriesByIDs.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sug="wso2.connector.sugarcrm.getEntries">
   <soapenv:Header/>
   <soapenv:Body>
   	 <sug:sugarCRMApiUrl>https://ypbvhe6054.trial.sugarcrm.com/soap.php</sug:sugarCRMApiUrl>
       <sug:session>cro7jca0b80vklrha2u4qdlnk7</sug:session>
       <sug:module_name>Accounts</sug:module_name>
       <sug:ids>
         	<item>2feb4d0e-31d8-8725-13e2-52bbddec05dd</item>
         	<item>bde9a025-28c7-bbc4-23fc-52bbecfd16bd</item>
       </sug:ids>
       <sug:select_fields>
         		<item>assigned_user_name</item>
         		<item>assigned_user_id</item>
       </sug:select_fields>           
   </soapenv:Body>
</soapenv:Envelope>